app/controllers/pages_controller.rb

SELECT  "projects".* FROM "projects"   ORDER BY "projects"."created_at" ASC LIMIT 12
---
  def index
    @projects = Project.all.order(:created_at).limit(12)

INSERT INTO "projects" ("created_at", "desc", "img", "title", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
  def create
    @project = Project.new(project_params)

    if @project.save

SELECT  "projects".* FROM "projects"  WHERE "projects"."id" = $1 LIMIT 1  [["id", 0]]
UPDATE "projects" SET "desc" = $1, "title" = $2, "updated_at" = $3 WHERE "projects"."id" = 3  [["desc", "Create a calculator to do some maths, this project is great for begineers!"], ["title", "Calculator"], ["updated_at", "2015-02-15 21:58:31.451810"]]
---
  def update
    @project = Project.find(params[:id])
    if @project.update_attributes(project_params)

SELECT  "projects".* FROM "projects"  WHERE "projects"."id" = $1 LIMIT 1  [["id", 2]]
---
  def delete
    @project = Project.find(params[:id])

DELETE FROM "projects" WHERE "projects"."id" = $1  [["id", 4]]
SELECT  "projects".* FROM "projects"  WHERE "projects"."id" = $1 LIMIT 1  [["id", 4]]
---
  def destroy
    Project.find(params[:id]).destroy